import IntroBalcony from "./intro";

import Balc from '../imgs/balcony/1.jpg'
import Okna from '../imgs/balcony/2.jpg'
import Roof from '../imgs/balcony/3.jpg'
import renderBalconyBlocks from "../../components/balcony";
import HowItBalcony from "./howit";
import CallUs from "./callus";



export default function Balcony(props) {
    

    return(
        <div className="balcony">
            <IntroBalcony/>
            <div className="big-info-container">
                {renderBalconyBlocks(bigData)}
            </div>
            <HowItBalcony/>
            <CallUs/>
        </div>
    )
}




const bigData = [
    {
        headline: 'Балкони',
        img: Balc,
        id: 'balck',
        frogs:[
            {
                title: '#1 Балкони',
                text: "Сучасні, високотехнологічні, якісні балкони на замповлення під ключ. Завдяки команді професіоналів, ми повністю впевнені в своїй роботі і сміливо можемо гарантувати найкращі ціни на ринку."
            },
            {
                title: '#2 Лоджія',
                text: "У боротьбі за корисними квадратними метрами ми намагаємося якомога компактніше і розумніше облаштувати свою площу. Раніше балкони були простором для зберігання зимових речей, літньої гуми тощо. Але зараз все перевернулося, ми намагаємося обживати кожен свій метр і це дуже правильно, адже грамотно продуманий ремонт зіграє у плюс у вашому повсякденному житті. Для цього у нашій компанії існує послуга «лоджія під ключ»"
            },
            {
                title: '#3 Реконструкція',
                text: "Одна з основних спеціалізацій  – це виготовлення та встановлення металопластикових конструкцій, а також комплексний ремонт балконів та лоджій. Ми пропонуємо все в комплексі, тому що знаємо, що більшості замовників зручніше та дешевше не розтягувати ремонт на тривалий час, а замовити всі роботи в одній організації."
            }
        ]
    },


    {
        headline: 'Вікна',
        img: Okna,
        id:'okna',
        frogs:[
            {
                title: '#1 Пластикові вікна',
                text: "Підберемо для вас як нове вікно так і бу варіант"
            },
            {
                title: '#2 Панорамні вікна',
                text: "сучасна і стильна система, яка є майже гладкою і суцільною конструкцією з надзвичайно міцного загартованого скла товщиною 8 або 10 мм. Завдяки своїй технології виготовлення таке скло ідеально рівне"
            },
            {
                title: '#3 Підвіконня',
                text: "Ми рекомендуємо довірити встановлення нашим фахівцям. Установка або монтаж підвіконня потребує досвіду та майстерності. Установку підвіконь роблять коли встановлюють вікно або ремонт будинку та квартири на стадії штукатурки, щоб фінальні роботи (укоси) змогли перекрити місця примикання підвіконь до стін."
            }
        ]
    },

    {
        headline: 'Дах',
        img: Roof,
        id: 'roof',
        frogs:[
            {
                title: '#1 Дах на балкон',
                text: "Встановлення та монтаж даху для Вашого балкону. Крім монтажу конструкцій, наші професіонали посилять його звукоізоляцію, герметичність, а також захист від різних погодних впливів. Після завершення встановлення даху на балкон, Ви можете сміливо його засклювати. У цьому питанні Вам знову допоможе наша компанія. Наші фахівці зроблять із вашого балкона – цукерку. Зрештою Ви отримаєте по-справжньому комфортний та якісно зроблений балкон, який подарує Вам суцільне задоволення від експлуатації."
            },
            {
                title: '#2 Зварний каркас',
                text: "Правильно проведені зварювальні роботи забезпечать не тільки міцність, але і повну герметичність, а також естетичність зовнішнього вигляду і внутрішнього оформлення. До того ж різні типи балконів та додаткових елементів припускають використання різних по конструкції каркасів. Основу виробу складає металевий каркас балкона, на ній і буде триматися вся балконна вага, тому в цьому випадку на матеріалах не слід економити, як і довіряти проведення робіт неперевіреним фахівцям. Слід розуміти, що зварювальний каркас балкона виконується для зниження тиску на балконні плити і перерозподілу наявного навантаження на стіну будівлі, що безпосередньо несе."
            },
            {
                title: '#3 Зовнішня обшивка балкону',
                text: "Зовнішня обшивка балкона або лоджії – це своєрідна унікальна модернізація. Вона тим, що допомагає ушляхетнити балкон із зовнішнього боку, а також відмінно захищає конструкцію від негативного впливу зовнішнього середовища: атмосферних та температурних впливів."
            },
            {
                title: '#4 Утеплення балкона',
                text: "Утеплення балкона дозволяє зробити з технічного приміщення в будинку затишне місце для відпочинку. Завдяки цьому на ньому можна проводити час навіть взимку, головне правильно підібрати матеріал і провести якісну установку всіх матеріалів."
            }
        ]
    },
]